Revit 2024 API
PerformanceAdviser.SetRuleEnabled Method (PerformanceAdviserRuleId, Boolean)
 Retrieves an enabled/disabled status for the given rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public void SetRuleEnabled(
	PerformanceAdviserRuleId id,
	bool enabled
)
Visual Basic
Public Sub SetRuleEnabled ( _
	id As PerformanceAdviserRuleId, _
	enabled As Boolean _
)
Visual C++
public:
void SetRuleEnabled(
	PerformanceAdviserRuleId^ id,
	bool enabled
)
Parameters
id
Type: Autodesk.Revit.DB.PerformanceAdviserRuleId
 The rule id to set enabled/disabled status for.
enabled
Type: System.Boolean
 True enables the rule, false disables.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The id does not correspond to any registered rule.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PerformanceAdviser Class
SetRuleEnabled Overload
Autodesk.Revit.DB Namespace